app/Http/Controllers/CategoryController.php

select * from `categories` limit 10 offset 0
select count(*) as aggregate from `categories`
---
    public function index()
    {
        $categories = Category::paginate(10);