app/Http/Controllers/Custumer_categoryController.php

    public function index()
    {
        $data = Custumer_category::all();
---
select * from `custumer_categories`