app/Http/Controllers/Custumer_logController.php

select * from `custumer_logs`
select * from `custumer_categories`
select * from `custumers`
select * from `products`
---
    public function index()
    {
        $data = Custumer_log::all();
        $c = Custumer_category::all();
        $m = Custumers::all();
        $p = Product::all();