app/Http/Controllers/CustumersController.php

select count(*) as aggregate from `custumers`
---
    public function index()
    {
        $data = Custumers::paginate(10);

select * from `categories`
---
    public function create()
    {
        $costumers = Category::all();

select * from `custumers` where `custumers`.`id` = '5' limit 1
---
    public function edit($id)
    {
        $data = Custumers::find($id);