app/Http/Controllers/CustumersController.php

select * from `categories`
---
    public function edit($id)
    {
        $data = Custumers::find($id);
//        $costumers = WareHous::all();
        $category= Custumer_category::all();