app/Http/Controllers/ProductController.php

insert into `products` (`code`, `name`, `artikul`, `category_id`, `updated_at`, `created_at`) values ('789', 'kiyim', 'gvhbjkn', '2', '2022-08-02 06:40:08', '2022-08-02 06:40:08')
insert into `product_logs` (`product_id`, `purchase_id`, `count`, `shelf_id`, `sum_came`, `sum_sell`, `sum_sell_optom`, `count_sell_optom`, `updated_at`, `created_at`) values (1, '1', '8855', '3', '985', '67', '6578', '567', '2022-08-02 06:40:08', '2022-08-02 06:40:08')
select * from `purchases` where `purchases`.`id` = '1' limit 1
update `purchases` set `AllSum` = 8722175, `purchases`.`updated_at` = '2022-08-02 06:40:08' where `id` = 1
---
    public function store(Request $request)
    {
        $date = new Product();
        $date->name = $request->name;
        $date->code = $request->code;
        $date->artikul = $request->artikul;
        $date->category_id = $request->category_id;
        $date->save();
//        $last = Product::orderBy('id', 'desc')->first();
        $id = $date->id;
//        dd($id);

        $data = new Product_log();
        $data->product_id = $id;
        $data->purchase_id = $request->purchase_id;
        $data->count = $request->count;
        $data->shelf_id = $request->shelf_id;
        $data->sum_came = $request->sum_came;
        $data->sum_sell = $request->sum_sell;
        $data->sum_sell_optom = $request->sum_sell_optom;
        $data->count_sell_optom = $request->count_sell_optom;
        $data->save();

        $pp = Purchases::find($request->purchase_id);
        $oldSum = $pp->AllSum;
        $pp->AllSum = $oldSum + $date->sum_came;
        $pp->save();