app/Http/Controllers/PurchasesController.php

select * from `purchases` where `purchases`.`id` = '1' limit 1
select * from `purchases` order by `id` desc limit 4 offset 0
select count(*) as aggregate from `purchases`
select * from `agents`
select * from `ware_houses`
select * from `categories`
select * from `products`
select * from `product_logs`
select * from `product_logs` where `purchase_id` = '1'
select * from `sizes`
select * from `shelfs`
select * from `shelfs` where `warehouse_id` = 1
---
    public function index(Request $request)
    {
        $id = $request['id'];

        if ($id != NULL)
            $layout = 'index';
        else
            $layout = '';

        if ($id != NULL) {
            $ombor_id = Purchases::find($id)->warehouse_id;
            $idi = Purchases::find($id);
            $idd = $idi->id;
        } else
            $idd = 0;


        $date = Purchases::OrderBy('id', 'desc')->paginate(4);
        $kontr = Agent::all();
        $ware = WareHous::all();
        $cotegory = Category::all();
        $product_all = Product::all();
        $product_log_all = Product_log::all();


        if ($id == NULL)
            $product_log = Product_log::all();
        else
            $product_log = Product_log::where('purchase_id', $id)->get();
        $size = Size::all();
        if ($id == NULL)
            $shelf = Shelf::all();
        else
            $shelf = Shelf::where('warehouse_id', $ombor_id)->get();

insert into `purchases` (`warehouse_id`, `kontragent_id`, `updated_at`, `created_at`) values ('1', '3', '2022-08-02 06:41:48', '2022-08-02 06:41:48')
---
    public function store(Request $request)
    {
        Purchases::create($request->all());