app/Http/Controllers/SizeController.php

select * from `sizes`
---
    public function index()
    {

         $size = Size::all();