app/Http/Controllers/WareHousController.php

select * from `ware_houses` limit 10 offset 0
select count(*) as aggregate from `ware_houses`
---
    public function index()
    {
        $warehouses=WareHous::paginate(10);